{
  "skills": {
    "languages": {
      "PHP": 1.00,
      "JavaScript / Typescript": 0.86,
      "Shopify Liquid": 0.57
    },
    "tools": {
      "Laravel": 1.00,
      "Vue.js": 0.74,
      "WordPress": 0.63,
      "Node.js": 0.52,
      "Figma": 0.42,
      "Google Analytics": 0
    },
    "areas": {
      "Back-end Development": 1.00,
      "Front-end Development": 0.74,
      "Server Management": 0.32
    },
    "other": {
      "Web Optimization": 0.61,
      "UI / UX - Prototyping": 0.21
    }
  },
  "timeline": [
    {
      "type": "work",
      "company": "LunarCP",
      "position": "Support Staff & Forum Moderator",
      "period": "Dec. 2011 - Apr. 2014",
      "description": [
        "I helped both as Forum Moderator and Support Staff for a free web hosting initiative, which in turn helped many people start their careers with web development, specially on developing countries and regions where one couldn't afford paying for hosting.",
        "One of the challenges I had to deal with, along with the team, was tracking down and removing malicious users who created accounts for abusing, spamming and phishing.",
        "This period of volunteer work provided me not only a lot of learning on web technologies, but also great networking and real experience with English."
      ]
    }, {
      "type": "work",
      "company": "Freelancer",
      "position": "Web Developer",
      "period": "Nov. 2011 - Sep. 2013",
      "description": [
        "My first contact at working with web development. During this period I developed a few institutional websites for local companies and a small CMS for a realtor business."
      ]
    }, {
      "type": "work",
      "company": "Digital Video",
      "position": "Video Editor",
      "period": "Oct. 2012 - Mar. 2014",
      "description": [
        "Worked mostly editing social events like weddings, with some experience too in camera operation, color grading and disc authoring using tools like Adobe Premiere Pro, Photoshop, Encore, Sony DVD Architect and GrassValley Edius."
      ]
    }, {
      "type": "work",
      "company": "Foto Click Digital",
      "position": "Photo Editor",
      "period": "Jan. 2014 - Nov. 2015",
      "description": [
        "During this period I worked editing both event and studio photography, while also creating designs for cards, clothing and similar stuff. Also worked with video production and editing for this company."
      ]
    }, {
      "type": "work",
      "company": "Tecnoblog",
      "position": "Full-stack Developer",
      "period": "Jun. 2018 - Sep. 2018",
      "description": [
        "During my first time at Tecnoblog, I was responsible for implementing new features on the existing website and mostly doing migration and optimization work after the acquisition of the Meio Bit news portal. I also helped on the creation of an in-house tool for implementing both Google GPT and Prebid in an integrated manner."
      ]
    }, {
      "type": "work",
      "company": "B2S Marketing",
      "position": "Full-stack Web Developer",
      "period": "Jun. 2016 - Jun. 2019",
      "description": [
        "Responsible for development, maintenance and optimization of both internal and client applications, systems and websites, using tools like WordPress, Laravel, Lliure and CodeIgniter.",
        "I also did some work regarding performance and SEO analysis and optimizations for existing and new clients."
      ]
    }, {
      "type": "work",
      "company": "Tecnoblog",
      "position": "Full-stack Developer",
      "period": "Jul. 2019 - Sep. 2020",
      "description": [
        "At Tecnoblog I was responsible for maintenance and optimization of the news portals Tecnoblog and Meio Bit, which includes both performance and SEO related optimizations, while also working closely to their design and editorial teams.",
        "I also worked on both developing and maintaining existing and new tools, creating new pages, implementing new features and implementing an integrated solution that works with both Google Publisher Tags and Prebid."
      ]
    }, {
      "type": "work",
      "company": "Fintech in the IDtech/KYC market",
      "position": "Back-end Consultant (Laravel)",
      "period": "Mar. 2023 - May 2023",
      "description": [
        "Worked as a independent consultant/freelancer along with the company's internal development teams.",
        "Some highlights on this position were improving their product's performance, mainly by optimizing certain database queries, and implementing a new pub/sub system for communicating events between the application's back-end and front-end."
      ]
    }, {
      "type": "work",
      "company": "Subatomic",
      "position": "Founder & Developer",
      "period": "Nov. 2015 - Today",
      "current": true,
      "description": [
        "Company I started for consulting. Work I've done through it includes design, development, support and maintenance of websites and web applications for clients and in partnership with agencies."
      ]
    }, {
      "type": "work",
      "company": "Toptal",
      "position": "Software Developer,  Contractor",
      "period": "Mar. 2020 - Today",
      "current": true,
      "description": [
        "I do both freelance and contract work through Toptal, a select network of professionals who thrive to be the best on their fields.",
        "My working skills include back-end and front-end technologies, such as Node.js, Express.js, Vue.js, Laravel and WordPress."
      ]
    }
  ]
}